In [1]:
import numpy  as np
import pandas as pd

# **Sélectionner les données d'un dataframe**

In [2]:
notes_français = pd.Series({"Christophe": 0,  "Carla": 5, "Caroine": 20, "Jean-Baptiste": 12, "Florence": 19,   "Emma": 19})
notes_histoire = pd.Series({"Christophe": 0,  "Carla": 9, "Caroine": 20, "Jean-Baptiste": 18, "Florence": 20,   "Emma": 19})
notes_maths    = pd.Series({"Christophe": 17, "Carla": 6, "Caroine": 20, "Jean-Baptiste": 2,  "Florence": 15.5, "Emma": 19})
notes          = pd.DataFrame({'Français':notes_français,'Histoire':notes_histoire,'Maths':notes_maths})
notes

               Français  Histoire  Maths
Christophe            0         0   17.0
Carla                 5         9    6.0
Caroine              20        20   20.0
Jean-Baptiste        12        18    2.0
Florence             19        20   15.5
Emma                 19        19   19.0

In [3]:
# Sélection classique
notes['Maths']

Christophe       17.0
Carla             6.0
Caroine          20.0
Jean-Baptiste     2.0
Florence         15.5
Emma             19.0
Name: Maths, dtype: float64

In [4]:
# Autre manière
notes.Maths

Christophe       17.0
Carla             6.0
Caroine          20.0
Jean-Baptiste     2.0
Florence         15.5
Emma             19.0
Name: Maths, dtype: float64

In [5]:
notes.Maths is notes['Maths']

True

Les 2 manières ont un effet identique.

In [7]:
# Sélectionner plusieurs colonnes par une liste de liste
notes[['Histoire','Français']]

               Histoire  Français
Christophe            0         0
Carla                 9         5
Caroine              20        20
Jean-Baptiste        18        12
Florence             20        19
Emma                 19        19

IL n'y qu'une façon de séléctionenr plusieurs colonnes

#### _Pour sélectionner les lignes il y a 2 méthodes_

In [12]:
# Sélectionner avec la méthode loc() qui récupère les étiquettes
notes.loc['Emma']

Français    19.0
Histoire    19.0
Maths       19.0
Name: Emma, dtype: float64

In [13]:
# Sélectionner par l'indice
notes.iloc[3]

Français    12.0
Histoire    18.0
Maths        2.0
Name: Jean-Baptiste, dtype: float64

In [14]:
# Plusieurs linges
notes.iloc[[2,3,4,5]]

               Français  Histoire  Maths
Caroine              20        20   20.0
Jean-Baptiste        12        18    2.0
Florence             19        20   15.5
Emma                 19        19   19.0

In [16]:
# Plusieurs avec loc
notes.loc[notes.index[-4:]]

               Français  Histoire  Maths
Caroine              20        20   20.0
Jean-Baptiste        12        18    2.0
Florence             19        20   15.5
Emma                 19        19   19.0

In [17]:
# Sélection par une liste de noms d'index
notes.loc[["Carla", "Emma"]]

       Français  Histoire  Maths
Carla         5         9    6.0
Emma         19        19   19.0

In [19]:
# Sélection par une tranche (slice) de noms d'index
notes.loc["Carla":"Florence"] # Florence est incluse

               Français  Histoire  Maths
Carla                 5         9    6.0
Caroine              20        20   20.0
Jean-Baptiste        12        18    2.0
Florence             19        20   15.5

In [20]:
# Sélectionne les 3 premières lignes
notes.loc[notes.index[:3]]

            Français  Histoire  Maths
Christophe         0         0   17.0
Carla              5         9    6.0
Caroine           20        20   20.0

In [21]:
# Sélection par une condition booléenne
notes.loc[notes["Histoire"] > 15]

               Français  Histoire  Maths
Caroine              20        20   20.0
Jean-Baptiste        12        18    2.0
Florence             19        20   15.5
Emma                 19        19   19.0

In [ ]:
# Sélection par une fonction ou une méthode sur l'index (de type string)
notes.loc[notes.index.str.startswith("C")]

In [22]:
# Sélection par un masque booléen personnalisé
mask = (notes["Français"] > 10) & (notes["Histoire"] > 15)
notes.loc[mask]

               Français  Histoire  Maths
Caroine              20        20   20.0
Jean-Baptiste        12        18    2.0
Florence             19        20   15.5
Emma                 19        19   19.0

In [24]:
# Sélection par un ensemble d'index (set)
notes.loc[["Christophe","Emma"]]

            Français  Histoire  Maths
Christophe         0         0   17.0
Emma              19        19   19.0

In [25]:
# Sélection par un filtre sur l'index
notes.loc[notes.index.isin(["Carla", "Florence", "Emma"])]

          Français  Histoire  Maths
Carla            5         9    6.0
Florence        19        20   15.5
Emma            19        19   19.0

In [27]:
notes['Moyenne'] = ((notes['Français'] + notes['Histoire'] + notes['Maths']) / 3).round().astype(int)
notes

               Français  Histoire  Maths  Moyenne
Christophe            0         0   17.0        6
Carla                 5         9    6.0        7
Caroine              20        20   20.0       20
Jean-Baptiste        12        18    2.0       11
Florence             19        20   15.5       18
Emma                 19        19   19.0       19

In [28]:
# La moyenne de Florence
notes.loc['Florence','Moyenne']

np.int64(18)

In [29]:
# Les notes de français et d'histoire d'Emma et Florence
notes.loc[['Emma','Florence'],['Français','Histoire']]

          Français  Histoire
Emma            19        19
Florence        19        20

In [33]:
# Ajout des colonnes "Anglais" et "Informatique"
notes_anglais      = pd.Series({'Christophe': 1, 'Carla': 14, 'Caroine': 18, 'Jean-Baptiste': 17, 'Florence': 17, 'Emma': 20})
notes_informatique = pd.Series({'Christophe': 0, 'Carla': 15, 'Caroine': 19, 'Jean-Baptiste': 17, 'Florence': 18, 'Emma': 11})
notes['Anglais']      = notes_anglais
notes['Informatique'] = notes_informatique

# Calcule la moyenne
notes['Moyenne'] = ((notes['Français'] + notes['Histoire'] + notes['Maths'] + notes['Anglais'] + notes['Informatique']) / 5).round().astype(int)
notes

               Français  Histoire  Maths  Moyenne  Anglais  Informatique
Christophe            0         0   17.0        4        1             0
Carla                 5         9    6.0       10       14            15
Caroine              20        20   20.0       19       18            19
Jean-Baptiste        12        18    2.0       13       17            17
Florence             19        20   15.5       18       17            18
Emma                 19        19   19.0       18       20            11

In [34]:
# Déplacer colonne moyenne
colonnes = ['Français', 'Histoire', 'Maths', 'Anglais', 'Informatique', 'Moyenne']
notes = notes[colonnes]
notes

               Français  Histoire  Maths  Anglais  Informatique  Moyenne
Christophe            0         0   17.0        1             0        4
Carla                 5         9    6.0       14            15       10
Caroine              20        20   20.0       18            19       19
Jean-Baptiste        12        18    2.0       17            17       13
Florence             19        20   15.5       17            18       18
Emma                 19        19   19.0       20            11       18

In [35]:
notes

               Français  Histoire  Maths  Anglais  Informatique  Moyenne
Christophe            0         0   17.0        1             0        4
Carla                 5         9    6.0       14            15       10
Caroine              20        20   20.0       18            19       19
Jean-Baptiste        12        18    2.0       17            17       13
Florence             19        20   15.5       17            18       18
Emma                 19        19   19.0       20            11       18

In [36]:
# Maths en integer
notes['Maths'] = notes['Maths'].round().astype(int)
notes

               Français  Histoire  Maths  Anglais  Informatique  Moyenne
Christophe            0         0     17        1             0        4
Carla                 5         9      6       14            15       10
Caroine              20        20     20       18            19       19
Jean-Baptiste        12        18      2       17            17       13
Florence             19        20     16       17            18       18
Emma                 19        19     19       20            11       18

In [37]:
notes

               Français  Histoire  Maths  Anglais  Informatique  Moyenne
Christophe            0         0     17        1             0        4
Carla                 5         9      6       14            15       10
Caroine              20        20     20       18            19       19
Jean-Baptiste        12        18      2       17            17       13
Florence             19        20     16       17            18       18
Emma                 19        19     19       20            11       18

### **Sélectionner par tranche**

In [39]:
# Corriger le prénom de caroline

In [40]:
notes = pd.DataFrame({
    'Français': {"Christophe": 0, "Carla": 5, "Caroline": 20, "Jean-Baptiste": 12, "Florence": 19, "Emma": 19},
    'Histoire': {"Christophe": 0, "Carla": 9, "Caroline": 20, "Jean-Baptiste": 18, "Florence": 20, "Emma": 19},
    'Maths': {"Christophe": 17, "Carla": 6, "Caroline": 20, "Jean-Baptiste": 2, "Florence": 16, "Emma": 19},
    'Anglais': {"Christophe": 1, "Carla": 14, "Caroline": 18, "Jean-Baptiste": 17, "Florence": 17, "Emma": 20},
    'Informatique': {"Christophe": 0, "Carla": 15, "Caroline": 19, "Jean-Baptiste": 17, "Florence": 18, "Emma": 11}
})

# Calcule la moyenne et l'ajoute en dernière colonne
notes['Moyenne'] = notes.mean(axis=1).round().astype(int)
notes

               Français  Histoire  Maths  Anglais  Informatique  Moyenne
Christophe            0         0     17        1             0        4
Carla                 5         9      6       14            15       10
Caroline             20        20     20       18            19       19
Jean-Baptiste        12        18      2       17            17       13
Florence             19        20     16       17            18       18
Emma                 19        19     19       20            11       18

In [41]:
# Toutes les matihères Caroline à Florence
notes.loc['Caroline':'Florence', :]

               Français  Histoire  Maths  Anglais  Informatique  Moyenne
Caroline             20        20     20       18            19       19
Jean-Baptiste        12        18      2       17            17       13
Florence             19        20     16       17            18       18

In [43]:
# De Caroline à la fin et que la moyenne
notes.loc['Caroline':,'Moyenne']

Caroline         19
Jean-Baptiste    13
Florence         18
Emma             18
Name: Moyenne, dtype: int64

In [52]:
# Christophe et Carla de français à maths
notes.loc['Christophe':'Carla', 'Français':'Maths']

            Français  Histoire  Maths
Christophe         0         0     17
Carla              5         9      6

In [51]:
# Christophe et Carla avec les 3 premières colonnes
notes.loc['Christophe':'Carla', :'Maths']

            Français  Histoire  Maths
Christophe         0         0     17
Carla              5         9      6

In [53]:
# Christophe et Carla avec les 3 premières colonnes
notes.loc[:'Carla', :'Maths']

            Français  Histoire  Maths
Christophe         0         0     17
Carla              5         9      6

In [54]:
# Depuis Cartoline et depuis informatique
notes.loc['Caroline':, 'Informatique':]

               Informatique  Moyenne
Caroline                 19       19
Jean-Baptiste            17       13
Florence                 18       18
Emma                     11       18

#### Avec les indeices de lignes et colonnes

In [56]:
# Depuis Caro et de français à maths
notes.iloc[2:,0:3]                        # Attn, c'est exclusif

               Français  Histoire  Maths
Caroline             20        20     20
Jean-Baptiste        12        18      2
Florence             19        20     16
Emma                 19        19     19

In [60]:
# La moyenne de tous
notes.iloc[:,5]

Christophe        4
Carla            10
Caroline         19
Jean-Baptiste    13
Florence         18
Emma             18
Name: Moyenne, dtype: int64

In [62]:
notes.iloc[5]

Français        19
Histoire        19
Maths           19
Anglais         20
Informatique    11
Moyenne         18
Name: Emma, dtype: int64

Il cherche par défaut les colonnes

In [64]:
# À partir de Caro, toutes les matières
notes.iloc[2:7]

               Français  Histoire  Maths  Anglais  Informatique  Moyenne
Caroline             20        20     20       18            19       19
Jean-Baptiste        12        18      2       17            17       13
Florence             19        20     16       17            18       18
Emma                 19        19     19       20            11       18

S'il n'y a rien à préciser les `:` sont superfétatoire  
avec `loc` et `iloc`